# frozen_string_literal: true

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'shiwano/formulas'

brew 'mas'
brew 'misakura'
brew 'git'
brew 'zsh'
brew 'zsh-completions'
brew 'mise'
brew 'coreutils'
brew 'curl'
brew 'wget'
brew 'tree'
brew 'ack'
brew 'gnu-sed'
brew 'gawk'
brew 'mcrypt'
brew 'jpeg'
brew 'pstree'
brew 'openssl'
brew 'libxml2'
brew 'lv'
brew 'nkf'
brew 'watch'
brew 'nmap'
brew 'iproute2mac'
brew 'clang-format'
brew 'mingw-w64'
brew 'libidn'
brew 'graphviz'
brew 'imagemagick'
brew 'kitty'
brew 'gnuplot'
brew 'sl'
brew 'terminal-notifier'

cask 'alfred'
cask 'google-chrome'
cask 'firefox'
cask 'appcleaner'
cask 'dropbox'
cask 'keepassxc'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'
cask 'libreoffice'
cask 'steam'
cask 'android-sdk'
cask 'android-platform-tools'
cask 'android-studio'
cask 'slack'
cask 'google-japanese-ime'
cask 'docker'
cask 'karabiner-elements'
cask 'font-sauce-code-pro-nerd-font'
cask 'ngrok'
cask 'kindle'
cask 'zoom'
cask 'google-cloud-sdk'
cask 'tableplus'
cask 'discord'
cask 'imageoptim'
cask 'wireshark'
cask 'ghostty'
cask 'hammerspoon'
cask 'chatgpt'

mas 'The Unarchiver', id: 425_424_353
mas 'LINE', id: 539_883_307
