# frozen_string_literal: true

cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'shiwano/formulas'
tap 'cosmo0920/mingw_w64'

brew 'zsh'
brew 'git'
brew 'the_silver_searcher'
brew 'reattach-to-user-namespace'
brew 'ctags'
brew 'cmake'
brew 'tmux'
brew 'coreutils'
brew 'wget'
brew 'tree'
brew 'ack'
brew 'mcrypt'
brew 'jpeg'
brew 'pstree'
brew 'gnu-sed'
brew 'curl'
brew 'openssl'
brew 'libxml2'
brew 'imagemagick'
brew 'lv'
brew 'nkf'
brew 'md5sha1sum'
brew 'hub'
brew 'peco'
brew 'mercurial'
brew 'android-sdk'
brew 'ant'
brew 'watch'
brew 'musta'
brew 'misakura'
brew 'multitail'
brew 'iproute2mac'
brew 'clang-format'
brew 'mingw-w64'
brew 'neovim'
brew 'direnv'
brew 'libimobiledevice'
brew 'ideviceinstaller'
brew 'cocoapods'
brew 'ios-deploy'
brew 'jq'
brew 'stern'

cask 'alfred'
cask 'google-chrome'
cask 'firefox'
cask 'iterm2'
cask 'appcleaner'
cask 'skype'
cask 'keepassx'
cask 'virtualbox'
cask 'vagrant'
cask 'growlnotify'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'
cask 'libreoffice'
cask 'trailer'
cask 'steam'
cask 'licecap'
cask 'gyazo'
cask 'spectacle'
