{
  "Align": { "branch": "master" },
  "ale": { "branch": "master" },
  "coc.nvim": { "branch": "release" },
  "copilot.vim": { "branch": "release" },
  "dart-vim-plugin": { "branch": "master" },
  "diagram.nvim": { "branch": "master" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "gotests-vim": { "branch": "master" },
  "hererocks": { "branch": "master" },
  "image.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "markdown-preview.nvim": { "branch": "master" },
  "nvim-base16": { "branch": "master" },
  "nvim-bqf": { "branch": "main" },
  "nvim-highlight-colors": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "rainbow_csv": { "branch": "master" },
  "rename.vim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
  "ts-comments.nvim": { "branch": "main" },
  "vim-caser": { "branch": "master" },
  "vim-clang-format": { "branch": "master" },
  "vim-delve": { "branch": "master" },
  "vim-gh-line": { "branch": "master" },
  "vim-goimports": { "branch": "master" },
  "vim-localrc": { "branch": "master" },
  "vim-markdownfmt": { "branch": "master" },
  "vim-nuuid": { "branch": "master" },
  "vim-prettier": { "branch": "master" },
  "vim-projectionist": { "branch": "master" },
  "vim-qfreplace": { "branch": "master" },
  "vim-quickrun": { "branch": "master" },
  "vim-rails": { "branch": "master" },
  "vim-sandwich": { "branch": "master" },
  "vim-smartinput": { "branch": "master" },
  "yankround.vim": { "branch": "master" }
}
