# frozen_string_literal: true

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'shiwano/formulas'

brew 'misakura'
brew 'git'
brew 'git-lfs'
brew 'zsh'
brew 'zsh-completions'
brew 'asdf'
brew 'tmux'
brew 'coreutils'
brew 'curl'
brew 'wget'
brew 'tree'
brew 'ack'
brew 'gnu-sed'
brew 'cmake'
brew 'mcrypt'
brew 'jpeg'
brew 'pstree'
brew 'openssl'
brew 'libxml2'
brew 'lv'
brew 'nkf'
brew 'watch'
brew 'nmap'
brew 'iproute2mac'
brew 'clang-format'
brew 'mingw-w64'
brew 'neovim'
brew 'stern'
brew 'mas'
brew 'ghq'
brew 'libidn'
brew 'awscli'
brew 'amazon-ecs-cli'
brew 'graphviz'
brew 'bazelisk'
brew 'fzf'
brew 'ripgrep'
brew 'bat'
brew 'java'
brew 'plantuml'
brew 'gh'
brew 'openapi-generator'
brew 'stripe/stripe-cli/stripe'
brew 'git-delta'
brew 'imagemagick'
brew 'kitty'
brew 'gnuplot'
brew 'stylua'
brew 'lua-language-server'
brew 'fastfetch'

cask 'alfred'
cask 'google-chrome'
cask 'firefox'
cask 'appcleaner'
cask 'dropbox'
cask 'keepassxc'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'
cask 'libreoffice'
cask 'steam'
cask 'gyazo'
cask 'spectacle'
cask 'android-sdk'
cask 'android-platform-tools'
cask 'android-studio'
cask 'slack'
cask 'google-japanese-ime'
cask 'docker'
cask 'karabiner-elements'
cask 'font-sauce-code-pro-nerd-font'
cask 'ngrok'
cask 'kindle'
cask 'zoom'
cask 'deepl'
cask 'google-cloud-sdk'
cask 'tableplus'
cask 'discord'
cask 'microsoft-edge-dev'
cask 'imageoptim'
cask 'wireshark'
cask 'ghostty'

mas 'The Unarchiver', id: 425_424_353
mas 'LINE', id: 539_883_307
